[X2DownloadableContentInfo_AddedPartNames]

;---------------------------
; Mrk's Haloooooooaooooaoo
;---------------------------

;---------------------------
;Torso
;---------------------------
.TorsoTemplate="H5_Techsuit_K_M"
.TorsoName="雷神之锤[2代]套装"

.TorsoTemplate="H5_Techsuit_K_F"
.TorsoName="雷神之锤[2代]套装"

.TorsoTemplate="H5_Techsuit_LP_M"
.TorsoName="雷神之锤[2代]套装"

.TorsoTemplate="H5_Techsuit_LP_F"
.TorsoName="雷神之锤[2代]套装"

.TorsoTemplate="H5_Techsuit_MP_M"
.TorsoName="雷神之锤[2代]套装"

.TorsoTemplate="H5_Techsuit_MP_F"
.TorsoName="雷神之锤[2代]套装"

.TorsoTemplate="H5_Techsuit_HP_M"
.TorsoName="雷神之锤[2代]套装"

.TorsoTemplate="H5_Techsuit_HP_F"
.TorsoName="雷神之锤[2代]套装"

.TorsoTemplate="H5_Techsuit_LPWR_M"
.TorsoName="雷神之锤[2代]套装"

.TorsoTemplate="H5_Techsuit_LPWR_F"
.TorsoName="雷神之锤[2代]套装"

.TorsoTemplate="H5_Techsuit_MPWR_M"
.TorsoName="雷神之锤[2代]套装"

.TorsoTemplate="H5_Techsuit_MPWR_F"
.TorsoName="雷神之锤[2代]套装"

.TorsoTemplate="H5_Techsuit_HPWR_M"
.TorsoName="雷神之锤[2代]套装"

.TorsoTemplate="H5_Techsuit_HPWR_F"
.TorsoName="雷神之锤[2代]套装"

;---------------------------
;DOA4 MK6 Gen1
;---------------------------
.TorsoTemplate="DOA4_MkVI_K_M"
.TorsoName="雷神之锤 动力甲/马克6"

.TorsoTemplate="DOA4_MkVI_K_F"
.TorsoName="雷神之锤 动力甲/马克6"

;---------------------------
;H5 MK4 Gen1
;---------------------------
.TorsoTemplate="H5_MkIVGen1_K_M"
.TorsoName="2代 马克4 [1代]"

.TorsoTemplate="H5_MkIVGen1_K_F"
.TorsoName="2代 马克4 [1代]"

.TorsoTemplate="H5_MkIVGen1_LP_M"
.TorsoName="2代 马克4 [1代]"

.TorsoTemplate="H5_MkIVGen1_LP_F"
.TorsoName="2代 马克4 [1代]"

.TorsoTemplate="H5_MkIVGen1_MP_M"
.TorsoName="2代 马克4 [1代]"

.TorsoTemplate="H5_MkIVGen1_MP_F"
.TorsoName="2代 马克4 [1代]"

.TorsoTemplate="H5_MkIVGen1_HP_M"
.TorsoName="2代 马克4 [1代]"

.TorsoTemplate="H5_MkIVGen1_HP_F"
.TorsoName="2代 马克4 [1代]"

.TorsoTemplate="H5_MkIVGen1_LPWR_M"
.TorsoName="2代 马克4 [1代]"

.TorsoTemplate="H5_MkIVGen1_LPWR_F"
.TorsoName="2代 马克4 [1代]"

.TorsoTemplate="H5_MkIVGen1_MPWR_M"
.TorsoName="2代 马克4 [1代]"

.TorsoTemplate="H5_MkIVGen1_MPWR_F"
.TorsoName="2代 马克4 [1代]"

.TorsoTemplate="H5_MkIVGen1_HPWR_M"
.TorsoName="2代 马克4 [1代]"

.TorsoTemplate="H5_MkIVGen1_HPWR_F"
.TorsoName="2代 马克4 [1代]"

;---------------------------
;H4 MK5 Gen1 Hybrid
;---------------------------
.TorsoTemplate="H4_MkVHybrid_K_M"
.TorsoName="2代 马克5 [1代]"

.TorsoTemplate="H4_MkVHybrid_K_F"
.TorsoName="2代 马克5 [1代]"

.TorsoTemplate="H4_MkVHybrid_LP_M"
.TorsoName="2代 马克5 [1代]"

.TorsoTemplate="H4_MkVHybrid_LP_F"
.TorsoName="2代 马克5 [1代]"

.TorsoTemplate="H4_MkVHybrid_MP_M"
.TorsoName="2代 马克5 [1代]"

.TorsoTemplate="H4_MkVHybrid_MP_F"
.TorsoName="2代 马克5 [1代]"

.TorsoTemplate="H4_MkVHybrid_HP_M"
.TorsoName="2代 马克5 [1代]"

.TorsoTemplate="H4_MkVHybrid_HP_F"
.TorsoName="2代 马克5 [1代]"

.TorsoTemplate="H4_MkVHybrid_LPWR_M"
.TorsoName="2代 马克5 [1代]"

.TorsoTemplate="H4_MkVHybrid_LPWR_F"
.TorsoName="2代 马克5 [1代]"

.TorsoTemplate="H4_MkVHybrid_MPWR_M"
.TorsoName="2代 马克5 [1代]"

.TorsoTemplate="H4_MkVHybrid_MPWR_F"
.TorsoName="2代 马克5 [1代]"

.TorsoTemplate="H4_MkVHybrid_HPWR_M"
.TorsoName="2代 马克5 [1代]"

.TorsoTemplate="H4_MkVHybrid_HPWR_F"
.TorsoName="2代 马克5 [1代]"

;---------------------------
;H5 MK5 Alpha
;---------------------------
.TorsoTemplate="H5_MkVAlpha_K_M"
.TorsoName="2代 马克5 阿尔法"

.TorsoTemplate="H5_MkVAlpha_K_F"
.TorsoName="2代 马克5 阿尔法"

.TorsoTemplate="H5_MkVAlphawithbelt_K_M"
.TorsoName="2代 马克5 阿尔法 (有腰带)"

.TorsoTemplate="H5_MkVAlphawithbelt_K_F"
.TorsoName="2代 马克5 阿尔法 (有腰带)"

.TorsoTemplate="H5_MkVAlpha_LP_M"
.TorsoName="2代 马克5 阿尔法"

.TorsoTemplate="H5_MkVAlpha_LP_F"
.TorsoName="2代 马克5 阿尔法"

.TorsoTemplate="H5_MkVAlphawithbelt_LP_M"
.TorsoName="2代 马克5 阿尔法 (有腰带)"

.TorsoTemplate="H5_MkVAlphawithbelt_LP_F"
.TorsoName="2代 马克5 阿尔法 (有腰带)"

.TorsoTemplate="H5_MkVAlpha_MP_M"
.TorsoName="2代 马克5 阿尔法"

.TorsoTemplate="H5_MkVAlpha_MP_F"
.TorsoName="2代 马克5 阿尔法"

.TorsoTemplate="H5_MkVAlphawithbelt_MP_M"
.TorsoName="2代 马克5 阿尔法 (有腰带)"

.TorsoTemplate="H5_MkVAlphawithbelt_MP_F"
.TorsoName="2代 马克5 阿尔法 (有腰带)"

.TorsoTemplate="H5_MkVAlpha_HP_M"
.TorsoName="2代 马克5 阿尔法"

.TorsoTemplate="H5_MkVAlpha_HP_F"
.TorsoName="2代 马克5 阿尔法"

.TorsoTemplate="H5_MkVAlphawithbelt_HP_M"
.TorsoName="2代 马克5 阿尔法 (有腰带)"

.TorsoTemplate="H5_MkVAlphawithbelt_HP_F"
.TorsoName="2代 马克5 阿尔法 (有腰带)"

.TorsoTemplate="H5_MkVAlpha_LPWR_M"
.TorsoName="2代 马克5 阿尔法"

.TorsoTemplate="H5_MkVAlpha_LPWR_F"
.TorsoName="2代 马克5 阿尔法"

.TorsoTemplate="H5_MkVAlphawithbelt_LPWR_M"
.TorsoName="2代 马克5 阿尔法 (有腰带)"

.TorsoTemplate="H5_MkVAlphawithbelt_LPWR_F"
.TorsoName="2代 马克5 阿尔法 (有腰带)"

.TorsoTemplate="H5_MkVAlpha_MPWR_M"
.TorsoName="2代 马克5 阿尔法"

.TorsoTemplate="H5_MkVAlpha_MPWR_F"
.TorsoName="2代 马克5 阿尔法"

.TorsoTemplate="H5_MkVAlphawithbelt_MPWR_M"
.TorsoName="2代 马克5 阿尔法 (有腰带)"

.TorsoTemplate="H5_MkVAlphawithbelt_MPWR_F"
.TorsoName="2代 马克5 阿尔法 (有腰带)"

.TorsoTemplate="H5_MkVAlpha_HPWR_M"
.TorsoName="2代 马克5 阿尔法"

.TorsoTemplate="H5_MkVAlpha_HPWR_F"
.TorsoName="2代 马克5 阿尔法"

.TorsoTemplate="H5_MkVAlphawithbelt_HPWR_M"
.TorsoName="2代 马克5 阿尔法 (有腰带)"

.TorsoTemplate="H5_MkVAlphawithbelt_HPWR_F"
.TorsoName="2代 马克5 阿尔法 (有腰带)"

;---------------------------
;H5 MK6 Gen1
;---------------------------
.TorsoTemplate="H5_MkVIGen1_K_M"
.TorsoName="2代 马克6 [1代]"

.TorsoTemplate="H5_MkVIGen1_K_F"
.TorsoName="2代 马克6 [1代]"

.TorsoTemplate="H5_MkVIGen1_LP_M"
.TorsoName="2代 马克6 [1代]"

.TorsoTemplate="H5_MkVIGen1_LP_F"
.TorsoName="2代 马克6 [1代]"

.TorsoTemplate="H5_MkVIGen1_MP_M"
.TorsoName="2代 马克6 [1代]"

.TorsoTemplate="H5_MkVIGen1_MP_F"
.TorsoName="2代 马克6 [1代]"

.TorsoTemplate="H5_MkVIGen1_HP_M"
.TorsoName="2代 马克6 [1代]"

.TorsoTemplate="H5_MkVIGen1_HP_F"
.TorsoName="2代 马克6 [1代]"

.TorsoTemplate="H5_MkVIGen1_LPWR_M"
.TorsoName="2代 马克6 [1代]"

.TorsoTemplate="H5_MkVIGen1_LPWR_F"
.TorsoName="2代 马克6 [1代]"

.TorsoTemplate="H5_MkVIGen1_MPWR_M"
.TorsoName="2代 马克6 [1代]"

.TorsoTemplate="H5_MkVIGen1_MPWR_F"
.TorsoName="2代 马克6 [1代]"

.TorsoTemplate="H5_MkVIGen1_HPWR_M"
.TorsoName="2代 马克6 [1代]"

.TorsoTemplate="H5_MkVIGen1_HPWR_F"
.TorsoName="2代 马克6 [1代]"

;---------------------------
;H5 MK6 Gen1 Scarred
;---------------------------

.TorsoTemplate="H5_MkVIGen1Scarred_K_M"
.TorsoName="2代 马克6 [1代] 战损版"

.TorsoTemplate="H5_MkVIGen1Scarred_K_F"
.TorsoName="2代 马克6 [1代] 战损版"

.TorsoTemplate="H5_MkVIGen1Scarred_LP_M"
.TorsoName="2代 马克6 [1代] 战损版"

.TorsoTemplate="H5_MkVIGen1Scarred_LP_F"
.TorsoName="2代 马克6 [1代] 战损版"

.TorsoTemplate="H5_MkVIGen1Scarred_MP_M"
.TorsoName="2代 马克6 [1代] 战损版"

.TorsoTemplate="H5_MkVIGen1Scarred_MP_F"
.TorsoName="2代 马克6 [1代] 战损版"

.TorsoTemplate="H5_MkVIGen1Scarred_HP_M"
.TorsoName="2代 马克6 [1代] 战损版"

.TorsoTemplate="H5_MkVIGen1Scarred_HP_F"
.TorsoName="2代 马克6 [1代] 战损版"

.TorsoTemplate="H5_MkVIGen1Scarred_LPWR_M"
.TorsoName="2代 马克6 [1代] 战损版"

.TorsoTemplate="H5_MkVIGen1Scarred_LPWR_F"
.TorsoName="2代 马克6 [1代] 战损版"

.TorsoTemplate="H5_MkVIGen1Scarred_MPWR_M"
.TorsoName="2代 马克6 [1代] 战损版"

.TorsoTemplate="H5_MkVIGen1Scarred_MPWR_F"
.TorsoName="2代 马克6 [1代] 战损版"

.TorsoTemplate="H5_MkVIGen1Scarred_HPWR_M"
.TorsoName="2代 马克6 [1代] 战损版"

.TorsoTemplate="H5_MkVIGen1Scarred_HPWR_F"
.TorsoName="2代 马克6 [1代] 战损版"

;---------------------------
;H5 MK6 Gen2
;---------------------------

.TorsoTemplate="H5_MkVIGen2_K_M"
.TorsoName="2代 马克6"

.TorsoTemplate="H5_MkVIGen2_K_F"
.TorsoName="2代 马克6"

.TorsoTemplate="H5_MkVIGen2_LP_M"
.TorsoName="2代 马克6"

.TorsoTemplate="H5_MkVIGen2_LP_F"
.TorsoName="2代 马克6"

.TorsoTemplate="H5_MkVIGen2_MP_M"
.TorsoName="2代 马克6"

.TorsoTemplate="H5_MkVIGen2_MP_F"
.TorsoName="2代 马克6"

.TorsoTemplate="H5_MkVIGen2_HP_M"
.TorsoName="2代 马克6"

.TorsoTemplate="H5_MkVIGen2_HP_F"
.TorsoName="2代 马克6"

.TorsoTemplate="H5_MkVIGen2_LPWR_M"
.TorsoName="2代 马克6"

.TorsoTemplate="H5_MkVIGen2_LPWR_F"
.TorsoName="2代 马克6"

.TorsoTemplate="H5_MkVIGen2_MPWR_M"
.TorsoName="2代 马克6"

.TorsoTemplate="H5_MkVIGen2_MPWR_F"
.TorsoName="2代 马克6"

.TorsoTemplate="H5_MkVIGen2_HPWR_M"
.TorsoName="2代 马克6"

.TorsoTemplate="H5_MkVIGen2_HPWR_F"
.TorsoName="2代 马克6"

;---------------------------
;H5 MK6 Gen2 MOD
;---------------------------

.TorsoTemplate="H5_MkVIMod_K_M"
.TorsoName="2代 马克6 MOD"

.TorsoTemplate="H5_MkVIMod_K_F"
.TorsoName="2代 马克6 MOD"

.TorsoTemplate="H5_MkVIMod_LP_M"
.TorsoName="2代 马克6 MOD"

.TorsoTemplate="H5_MkVIMod_LP_F"
.TorsoName="2代 马克6 MOD"

.TorsoTemplate="H5_MkVIMod_MP_M"
.TorsoName="2代 马克6 MOD"

.TorsoTemplate="H5_MkVIMod_MP_F"
.TorsoName="2代 马克6 MOD"

.TorsoTemplate="H5_MkVIMod_HP_M"
.TorsoName="2代 马克6 MOD"

.TorsoTemplate="H5_MkVIMod_HP_F"
.TorsoName="2代 马克6 MOD"

.TorsoTemplate="H5_MkVIMod_LPWR_M"
.TorsoName="2代 马克6 MOD"

.TorsoTemplate="H5_MkVIMod_LPWR_F"
.TorsoName="2代 马克6 MOD"

.TorsoTemplate="H5_MkVIMod_MPWR_M"
.TorsoName="2代 马克6 MOD"

.TorsoTemplate="H5_MkVIMod_MPWR_F"
.TorsoName="2代 马克6 MOD"

.TorsoTemplate="H5_MkVIMod_HPWR_M"
.TorsoName="2代 马克6 MOD"

.TorsoTemplate="H5_MkVIMod_HPWR_F"
.TorsoName="2代 马克6 MOD"

;---------------------------
;Legs
;---------------------------

;---------------------------
;H4 MK5 Gen1 Hybrid
;---------------------------
.LegsTemplate="H5_MkIVGen1Legs_K_M"
.LegsName="2代 马克4 [1代]"

.LegsTemplate="H5_MkIVGen1Legs_K_F"
.LegsName="2代 马克4 [1代]"

.LegsTemplate="H5_MkIVGen1Legs_LP_M"
.LegsName="2代 马克4 [1代]"

.LegsTemplate="H5_MkIVGen1Legs_LP_F"
.LegsName="2代 马克4 [1代]"

.LegsTemplate="H5_MkIVGen1Legs_MP_M"
.LegsName="2代 马克4 [1代]"

.LegsTemplate="H5_MkIVGen1Legs_MP_F"
.LegsName="2代 马克4 [1代]"

.LegsTemplate="H5_MkIVGen1Legs_HP_M"
.LegsName="2代 马克4 [1代]"

.LegsTemplate="H5_MkIVGen1Legs_HP_F"
.LegsName="2代 马克4 [1代]"

.LegsTemplate="H5_MkIVGen1Legs_LPWR_M"
.LegsName="2代 马克4 [1代]"

.LegsTemplate="H5_MkIVGen1Legs_LPWR_F"
.LegsName="2代 马克4 [1代]"

.LegsTemplate="H5_MkIVGen1Legs_MPWR_M"
.LegsName="2代 马克4 [1代]"

.LegsTemplate="H5_MkIVGen1Legs_MPWR_F"
.LegsName="2代 马克4 [1代]"

.LegsTemplate="H5_MkIVGen1Legs_HPWR_M"
.LegsName="2代 马克4 [1代]"

.LegsTemplate="H5_MkIVGen1Legs_HPWR_F"
.LegsName="2代 马克4 [1代]"

;---------------------------
;H4 MK5 Gen1 Hybrid
;---------------------------

.LegsTemplate="H4_MkVHybridLegs_K_M"
.LegsName="2代 马克5 [1代]"

.LegsTemplate="H4_MkVHybridLegs_K_F"
.LegsName="2代 马克5 [1代]"

.LegsTemplate="H4_MkVHybridLegs_LP_M"
.LegsName="2代 马克5 [1代]"

.LegsTemplate="H4_MkVHybridLegs_LP_F"
.LegsName="2代 马克5 [1代]"

.LegsTemplate="H4_MkVHybridLegs_MP_M"
.LegsName="2代 马克5 [1代]"

.LegsTemplate="H4_MkVHybridLegs_MP_F"
.LegsName="2代 马克5 [1代]"

.LegsTemplate="H4_MkVHybridLegs_HP_M"
.LegsName="2代 马克5 [1代]"

.LegsTemplate="H4_MkVHybridLegs_HP_F"
.LegsName="2代 马克5 [1代]"

.LegsTemplate="H4_MkVHybridLegs_LPWR_M"
.LegsName="2代 马克5 [1代]"

.LegsTemplate="H4_MkVHybridLegs_LPWR_F"
.LegsName="2代 马克5 [1代]"

.LegsTemplate="H4_MkVHybridLegs_MPWR_M"
.LegsName="2代 马克5 [1代]"

.LegsTemplate="H4_MkVHybridLegs_MPWR_F"
.LegsName="2代 马克5 [1代]"

.LegsTemplate="H4_MkVHybridLegs_HPWR_M"
.LegsName="2代 马克5 [1代]"

.LegsTemplate="H4_MkVHybridLegs_HPWR_F"
.LegsName="2代 马克5 [1代]"

;---------------------------
;H5 MK5 Alpha
;---------------------------

.LegsTemplate="H5_MkVAlphaLegs_K_M"
.LegsName="2代 马克5 阿尔法"

.LegsTemplate="H5_MkVAlphaLegs_K_F"
.LegsName="2代 马克5 阿尔法"

.LegsTemplate="H5_MkVAlphaLegs_LP_M"
.LegsName="2代 马克5 阿尔法"

.LegsTemplate="H5_MkVAlphaLegs_LP_F"
.LegsName="2代 马克5 阿尔法"

.LegsTemplate="H5_MkVAlphaLegs_MP_M"
.LegsName="2代 马克5 阿尔法"

.LegsTemplate="H5_MkVAlphaLegs_MP_F"
.LegsName="2代 马克5 阿尔法"

.LegsTemplate="H5_MkVAlphaLegs_HP_M"
.LegsName="2代 马克5 阿尔法"

.LegsTemplate="H5_MkVAlphaLegs_HP_F"
.LegsName="2代 马克5 阿尔法"

.LegsTemplate="H5_MkVAlphaLegs_LPWR_M"
.LegsName="2代 马克5 阿尔法"

.LegsTemplate="H5_MkVAlphaLegs_LPWR_F"
.LegsName="2代 马克5 阿尔法"

.LegsTemplate="H5_MkVAlphaLegs_MPWR_M"
.LegsName="2代 马克5 阿尔法"

.LegsTemplate="H5_MkVAlphaLegs_MPWR_F"
.LegsName="2代 马克5 阿尔法"

.LegsTemplate="H5_MkVAlphaLegs_HPWR_M"
.LegsName="2代 马克5 阿尔法"

.LegsTemplate="H5_MkVAlphaLegs_HPWR_F"
.LegsName="2代 马克5 阿尔法"

;---------------------------
;H5 MK6 Gen1
;---------------------------

.LegsTemplate="H5_MkVIGen1Legs_K_M"
.LegsName="2代 马克6 [1代]"

.LegsTemplate="H5_MkVIGen1Legs_K_F"
.LegsName="2代 马克6 [1代]"

.LegsTemplate="H5_MkVIGen1Legs_LP_M"
.LegsName="2代 马克6 [1代]"

.LegsTemplate="H5_MkVIGen1Legs_LP_F"
.LegsName="2代 马克6 [1代]"

.LegsTemplate="H5_MkVIGen1Legs_MP_M"
.LegsName="2代 马克6 [1代]"

.LegsTemplate="H5_MkVIGen1Legs_MP_F"
.LegsName="2代 马克6 [1代]"

.LegsTemplate="H5_MkVIGen1Legs_HP_M"
.LegsName="2代 马克6 [1代]"

.LegsTemplate="H5_MkVIGen1Legs_HP_F"
.LegsName="2代 马克6 [1代]"

.LegsTemplate="H5_MkVIGen1Legs_LPWR_M"
.LegsName="2代 马克6 [1代]"

.LegsTemplate="H5_MkVIGen1Legs_LPWR_F"
.LegsName="2代 马克6 [1代]"

.LegsTemplate="H5_MkVIGen1Legs_MPWR_M"
.LegsName="2代 马克6 [1代]"

.LegsTemplate="H5_MkVIGen1Legs_MPWR_F"
.LegsName="2代 马克6 [1代]"

.LegsTemplate="H5_MkVIGen1Legs_HPWR_M"
.LegsName="2代 马克6 [1代]"

.LegsTemplate="H5_MkVIGen1Legs_HPWR_F"
.LegsName="2代 马克6 [1代]"

;---------------------------
;H5 MK6 Gen1 Scarred
;---------------------------

.LegsTemplate="H5_MkVIGen1ScarredLegs_K_M"
.LegsName="2代 马克6 [1代] 战损版"

.LegsTemplate="H5_MkVIGen1ScarredLegs_K_F"
.LegsName="2代 马克6 [1代] 战损版"

.LegsTemplate="H5_MkVIGen1ScarredLegs_LP_M"
.LegsName="2代 马克6 [1代] 战损版"

.LegsTemplate="H5_MkVIGen1ScarredLegs_LP_F"
.LegsName="2代 马克6 [1代] 战损版"

.LegsTemplate="H5_MkVIGen1ScarredLegs_MP_M"
.LegsName="2代 马克6 [1代] 战损版"

.LegsTemplate="H5_MkVIGen1ScarredLegs_MP_F"
.LegsName="2代 马克6 [1代] 战损版"

.LegsTemplate="H5_MkVIGen1ScarredLegs_HP_M"
.LegsName="2代 马克6 [1代] 战损版"

.LegsTemplate="H5_MkVIGen1ScarredLegs_HP_F"
.LegsName="2代 马克6 [1代] 战损版"

.LegsTemplate="H5_MkVIGen1ScarredLegs_LPWR_M"
.LegsName="2代 马克6 [1代] 战损版"

.LegsTemplate="H5_MkVIGen1ScarredLegs_LPWR_F"
.LegsName="2代 马克6 [1代] 战损版"

.LegsTemplate="H5_MkVIGen1ScarredLegs_MPWR_M"
.LegsName="2代 马克6 [1代] 战损版"

.LegsTemplate="H5_MkVIGen1ScarredLegs_MPWR_F"
.LegsName="2代 马克6 [1代] 战损版"

.LegsTemplate="H5_MkVIGen1ScarredLegs_HPWR_M"
.LegsName="2代 马克6 [1代] 战损版"

.LegsTemplate="H5_MkVIGen1ScarredLegs_HPWR_F"
.LegsName="2代 马克6 [1代] 战损版"

;---------------------------
;H5 MK6 Gen2
;---------------------------

.LegsTemplate="H5_MkVIGen2Legs_K_M"
.LegsName="2代 马克6"

.LegsTemplate="H5_MkVIGen2Legs_K_F"
.LegsName="2代 马克6"

.LegsTemplate="H5_MkVIGen2Legs_LP_M"
.LegsName="2代 马克6"

.LegsTemplate="H5_MkVIGen2Legs_LP_F"
.LegsName="2代 马克6"

.LegsTemplate="H5_MkVIGen2Legs_MP_M"
.LegsName="2代 马克6"

.LegsTemplate="H5_MkVIGen2Legs_MP_F"
.LegsName="2代 马克6"

.LegsTemplate="H5_MkVIGen2Legs_HP_M"
.LegsName="2代 马克6"

.LegsTemplate="H5_MkVIGen2Legs_HP_F"
.LegsName="2代 马克6"

.LegsTemplate="H5_MkVIGen2Legs_LPWR_M"
.LegsName="2代 马克6"

.LegsTemplate="H5_MkVIGen2Legs_LPWR_F"
.LegsName="2代 马克6"

.LegsTemplate="H5_MkVIGen2Legs_MPWR_M"
.LegsName="2代 马克6"

.LegsTemplate="H5_MkVIGen2Legs_MPWR_F"
.LegsName="2代 马克6"

.LegsTemplate="H5_MkVIGen2Legs_HPWR_M"
.LegsName="2代 马克6"

.LegsTemplate="H5_MkVIGen2Legs_HPWR_F"
.LegsName="2代 马克6"

;---------------------------
;H5 MK6 Gen2 MOD
;---------------------------

.LegsTemplate="H5_MkVIModLegs_K_M"
.LegsName="2代 马克6 MOD"

.LegsTemplate="H5_MkVIModLegs_K_F"
.LegsName="2代 马克6 MOD"

.LegsTemplate="H5_MkVIModLegs_LP_M"
.LegsName="2代 马克6 MOD"

.LegsTemplate="H5_MkVIModLegs_LP_F"
.LegsName="2代 马克6 MOD"

.LegsTemplate="H5_MkVIModLegs_MP_M"
.LegsName="2代 马克6 MOD"

.LegsTemplate="H5_MkVIModLegs_MP_F"
.LegsName="2代 马克6 MOD"

.LegsTemplate="H5_MkVIModLegs_HP_M"
.LegsName="2代 马克6 MOD"

.LegsTemplate="H5_MkVIModLegs_HP_F"
.LegsName="2代 马克6 MOD"

.LegsTemplate="H5_MkVIModLegs_LPWR_M"
.LegsName="2代 马克6 MOD"

.LegsTemplate="H5_MkVIModLegs_LPWR_F"
.LegsName="2代 马克6 MOD"

.LegsTemplate="H5_MkVIModLegs_MPWR_M"
.LegsName="2代 马克6 MOD"

.LegsTemplate="H5_MkVIModLegs_MPWR_F"
.LegsName="2代 马克6 MOD"

.LegsTemplate="H5_MkVIModLegs_HPWR_M"
.LegsName="2代 马克6 MOD"

.LegsTemplate="H5_MkVIModLegs_HPWR_F"
.LegsName="2代 马克6 MOD"

;---------------------------
;H5 MK6 Gen2 MOD
;---------------------------

.LegsTemplate="H5_BLANKLegs_K_M"
.LegsName="雷神之锤[2代]套装"

.LegsTemplate="H5_BLANKLegs_K_F"
.LegsName="雷神之锤[2代]套装"

.LegsTemplate="H5_BLANKLegs_LP_M"
.LegsName="雷神之锤[2代]套装"

.LegsTemplate="H5_BLANKLegs_LP_F"
.LegsName="雷神之锤[2代]套装"

.LegsTemplate="H5_BLANKLegs_MP_M"
.LegsName="雷神之锤[2代]套装"

.LegsTemplate="H5_BLANKLegs_MP_F"
.LegsName="雷神之锤[2代]套装"

.LegsTemplate="H5_BLANKLegs_HP_M"
.LegsName="雷神之锤[2代]套装"

.LegsTemplate="H5_BLANKLegs_HP_F"
.LegsName="雷神之锤[2代]套装"

.LegsTemplate="H5_BLANKLegs_LPWR_M"
.LegsName="雷神之锤[2代]套装"

.LegsTemplate="H5_BLANKLegs_LPWR_F"
.LegsName="雷神之锤[2代]套装"

.LegsTemplate="H5_BLANKLegs_MPWR_M"
.LegsName="雷神之锤[2代]套装"

.LegsTemplate="H5_BLANKLegs_MPWR_F"
.LegsName="雷神之锤[2代]套装"

.LegsTemplate="H5_BLANKLegs_HPWR_M"
.LegsName="雷神之锤[2代]套装"

.LegsTemplate="H5_BLANKLegs_HPWR_F"
.LegsName="雷神之锤[2代]套装"